// 01_03_2025_BitOperations.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    unsigned short i = 100;
    std::cout << (i << 1) << std::endl;
    std::cout << (i << 2) << std::endl;
    std::cout << (i << 3) << std::endl;
    std::cout << (i << 4) << std::endl;

    int t = (~100 + 1) ;
    int d = (~65 + 1);
    std::cout << t << std::endl;
    std::cout << d << std::endl;
    std::cout << (2 & 1) << std::endl;
    std::cout << (2 | 1) << std::endl;
    std::cout << (3 ^ 1) << std::endl;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
