#include <iostream>
using namespace std;
int main()
{
	// определение размера массива
	const int size = 5;
	// создание и инициализация массива данными 

	int ar[size]={23,-11,9,-18,-25};
	// переменная для накопления суммы
	int sum = 0;
	// цикл, перебирающий по порядку элементы массива 
	
	for (int i=0;i<size;i++)
	{
		// если значение элемента отрицательное (меньше нуля) 
		if (ar[i] < 0)
			sum += ar[i]; // добавить его значение к общей сумме
	}
	// показ значения суммы на экран 
	cout<<"Sum = "<<sum<<"\n\n"; return 0;
}