/*
Модуль 4. Циклы, использование отладчика(3 пары).
Практическое занятие Неделя 7.
Задания для самостоятельной работы 2.

Вывести на экран ромб из звездочек.

       *
      ***
     *****
    *******
   *********
  ***********
 *************
***************
 *************
  ***********
   *********
    *******
     *****
      ***
       *
*/


#include <iostream>

using namespace std;

// Функция для вывода ромба
void printDiamond(int n) {
    // Верхняя часть ромба
    for (int i = 1; i <= n; i++) {
        // Выводим пробелы перед звездочками
        for (int j = 1; j <= n - i; j++) {
            cout << " ";
        }
        // Выводим звездочки
        for (int j = 1; j <= 2 * i - 1; j++) {
            cout << "*";
        }
        cout << endl;
    }

    // Нижняя часть ромба
    for (int i = n - 1; i >= 1; i--) {
        // Выводим пробелы перед звездочками
        for (int j = 1; j <= n - i; j++) {
            cout << " ";
        }
        // Выводим звездочки
        for (int j = 1; j <= 2 * i - 1; j++) {
            cout << "*";
        }
        cout << endl;
    }
}

int main() {
    int n;
    cout << "Введите размер ромба (половина высоты): ";
    cin >> n;
    printDiamond(n);
    return 0;
}
