#include <iostream>

using namespace std;

int main()
{

	// определения количества элементов массива 
	const int size = 5;
	// создание и инициализация массива 

	int ar[size] = { 23,11,9,18,25 };

	int max = ar[0]; // пусть 0 элемент максимальный 
	int min = ar[0];   // пусть 0 элемент минимальный
	// цикл перебирает элементы массива, начиная с 1-ы 

	for (int i = 1; i < size; i++)
	{
		// если текущий элемент меньше, чем минимум 
		if (min > ar[i])
			// перезаписать значение минимума 
			min = ar[i];

		// если текущий элемент больше, чем максимум 
		if (max < ar[i])
			// перезаписать значение максимума 
			max = ar[i];
	}
	// вывод результата на экран 
	cout << "Max = " << max << "\n\n";
	cout << "Min = " << min << "\n\n";
	return 0;
}
